// В Данный момент Prettier недостаточно зрел для того чтобы соответствовать все требованиям более менее сеорьезных проектов, слишком мало опций фроматирования

// module.exports = {
//   trailingComma: 'all', // везде где возможно ставим завершающие запятые
//   tabWidth: 2,
//   semi: true,
//   singleQuote: true,
//   printWidth: 80,
//   quoteProps: 'consistent', // если хоть одно свойство в объекте требует кавычек то заключить все свойства в кавычки
//   jsxSingleQuote: false, // в jsx используем двойные кавычки
//   bracketSpacing: true, // { foo: bar } расстояние между сколбками, работает только с итералами объектов
//   jsxBracketSameLine: false, // автоматически выставляет закрывающую > в jsx-компонентах в новую строку
//   arrowParens: 'always', // всегда (x) => x, не x => x,
//   // тут можно переопределить правила для
//   overrides: [
//     {
//       files: ['*.js', '*.jsx', '*.tsx', '*.ts'],
//       options: {},
//     },
//   ],
// };
